{
    "coverLetterParagraphs": [
        "I am a student at Hamline University pursuing a Bachelor of Science in Physics, expected to graduate June 2018.",
        "I first started programming when I was 15 years old, making my own small games in C++. I have been doing it for fun ever since. Rather than pursue a traditional computer science education, I decided to take classes that would provide me with an applied education in other relevant fields, namely mathematics and physics, and with conceptual tools to enable me to code more efficiently.",
        "During my undergraduate research studying properties of resonant structures,  I used electrical engineering concepts to make a results apparatus to video-track circular motion stereoscopically. I then tracked objects on video using color contrast, and fitted the tracking data to the theoretical model in Mathematica to develop a 3D model of the stereoscope video. During this research program I also gained managerial experience as I delegated projects to other undergraduate colleagues. At the conclusion of the research, I presented these research methods and results.",
        "In my sophomore year I started the Physics Club at Hamline in an effort to provide a place for undergraduates to augment their formal studies with practical applications and industry presentations. We’ve since grown to two dozen active members, and I have been responsible for organizing all educational workshops, activities, meetings, and events held by the club.",
        "During this time I also volunteered as a personal care assistant. I had a chance to tutor an autistic middle-school student in basic arithmetic and to present on physics topics at local middle schools. This experience taught me patience, communication, and developed my deeper understanding of individuals with disabilities.",
        "I have also worked in the restaurant industry my entire life, first in my family’s pizzeria throughout  high school, and now at a top restaurant in Minneapolis (ranked 23rd nationally by Tripadvisor). As a result, I am extremely familiar with fast-paced, results-focused, team-based, and customer-driven work environments, and I pride myself on working hard and getting things done.",
        "In my free time, I have honed my software engineering skills by working on a number of web-development-related side-projects based in PHP and Django (in addition to standard web the technologies like HTML, CSS, and JavaScript). For example, I have been working on  a web-based client for creating baseball scorecards. I am also currently working with a Hamline professor on a web-based x-ray diffraction machine, and with another professor on a website that will allow students to take a picture of their notebook and send it to the projector during class for discussion.",
        "As much as I have enjoyed my academic physics and mathematical education, I have come to realize that my true passions manifest in software engineering. I am excited by the prospect of honing my skills with a talented team on impactful projects."
    ],
	"resume": [
		{
			"heading": "Education",
			"organizations": [
				{
					"name": "Hamline University",
					"location": "St. Paul, PA",
					"positions": [
						{
							"title": "Bachelor of Science in Physics",
							"date": "Anticipated: June 2018",
							"description": ""
						},
						{
							"title": "Hamline Achievement Scholarship",
							"date": "August 2014-present",
							"description": ""
						}
					]
				}
			]
		},
		{
			"heading": "Language, Frameworks, and Tools",
			"organizations": [
				{
					"name": "",
					"location": "",
					"positions": [
						{
							"title": "Languages",
							"date": "",
							"description": "HTML/CSS, JavaScript, Python (Django), PHP, Java, C++"
						},
						{
							"title": "Tools",
							"date": "",
							"description": "Mathematica, Git , Bash"
						},
						{
							"title": "Skills",
							"date": "",
							"description": "Soldering"
						}
					]
				}
			]
		},
    {
			"heading": "Relevant Coursework",
			"organizations": [
				{
					"name": "",
					"location": "",
					"positions": [
						{
							"title": "Spring 2016 and Earlier",
							"date": "",
							"description": "Innovations with Roger Appeldorn, Multivariable Calculus, General Physics II, Genetics, Differential Equations, Modern Physics"
						},
						{
							"title": "Fall 2016",
							"date": "",
							"description": "Math Methods, Condensed Matter, Quantum Mechanics"
						}
					]
				}
			]
		},
		{
			"heading": "Clubs and organizations",
			"organizations": [
				{
					"name": "The Hamline Physics Club",
					"location": "",
					"positions": [
						{
							"title": "President and Founder",
							"date": "August 2014-August 2015",
							"description": "Created a club that serves students passionate about physics with education workshops. Personally organized all projects, activities, meetings, and events held by the club."
						}
					]
				}
			]
		},
		{
			"heading": "Experience",
			"organizations": [
				{
					"name": "Hamline University",
					"location": "St. Paul, MN",
					"positions": [
						{
							"title": "Research Assistant",
							"date": "June 2014-August 2014",
							"description": "Studied properties of resonant structures. Used electrical engineering concepts to make results’ apparatus. Video-tracked the circular motion stereoscopically. Used Mathematica to develop a 3D model of the stereoscope video. Presented on research methods and results."
						}
					]
				},
				{
					"name": "Student Experience",
					"location": "Minneapolis, MN",
					"positions": [
						{
							"title": "Personal Care Assistant",
							"date": "October 2014-January 2015",
							"description": "Gave care to and gained a deeper understanding of individuals with disabilities. Broadened my communication skills by helping others with their own. Learned how to be a responsible leader."

						}
					]
				},
				{
					"name": "The Butcher and the Boar",
					"location": "Minneapolis, MN",
					"positions": [
						{
							"title": "Wait Assistant",
							"date": "August 2015-present",
							"description": "Assist waiters, communicating with both wait staff and customers. Efficiently and simultaneously manage multiple responsibilities."

						}
					]
				}
			]
		}
	]
}
